# 10 Minutes to Pandas

Impor modul modul yang dibutuhkan

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Pembuatan Objek
Membuat Series dengan memberikan daftar nilai, membiarkan pandas membuat indeks bilangan bulat default:

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Membuat DataFrame dengan melewatkan array NumPy, dengan indeks datetime dan kolom berlabel:

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.755035 -0.484612 -0.717522 -0.687850
2013-01-02 -0.257250 -0.765153  1.093545  0.420117
2013-01-03 -0.922617  2.047103 -2.533124  0.690853
2013-01-04  0.355054  0.300695 -0.926397  1.703721
2013-01-05 -0.759857  0.366894 -1.023559  0.070350
2013-01-06 -1.370062  1.064458  0.188206 -0.977349

Membuat DataFrame dengan melewatkan sebuah objek yang dapat dikonversi menjadi series-like.

In [4]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

df2
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Menampilkan Data
Berikut ini cara melihat baris atas dan bawah frame:

In [5]:
df.head()
df.tail(3)
df.index
df.columns
df.values
df.describe()
df.T
df.sort_index(axis=1, ascending=False)
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.257250 -0.765153  1.093545  0.420117
2013-01-01  0.755035 -0.484612 -0.717522 -0.687850
2013-01-04  0.355054  0.300695 -0.926397  1.703721
2013-01-05 -0.759857  0.366894 -1.023559  0.070350
2013-01-06 -1.370062  1.064458  0.188206 -0.977349
2013-01-03 -0.922617  2.047103 -2.533124  0.690853

## Seleksi
Lihat dokumentasi pengindeksan [Indexing dan Memilih Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) dan [MultiIndex/Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced).

In [6]:
df['A']
df[0:3]
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.257250 -0.765153  1.093545  0.420117
2013-01-03 -0.922617  2.047103 -2.533124  0.690853
2013-01-04  0.355054  0.300695 -0.926397  1.703721

## Seleksi Berdasarkan Label
Untuk mendapatkan penampang menggunakan label:

In [7]:
df.loc[dates[0]]

A    0.755035
B   -0.484612
C   -0.717522
D   -0.687850
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [8]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.755035 -0.484612
2013-01-02 -0.257250 -0.765153
2013-01-03 -0.922617  2.047103
2013-01-04  0.355054  0.300695
2013-01-05 -0.759857  0.366894
2013-01-06 -1.370062  1.064458

Menampilkan slicing label, kedua titik akhir disertakan:

In [9]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.257250 -0.765153
2013-01-03 -0.922617  2.047103
2013-01-04  0.355054  0.300695

Pengurangan dimensi objek yang dikembalikan:

In [10]:
df.loc['20130102',['A','B']]

A   -0.257250
B   -0.765153
Name: 2013-01-02 00:00:00, dtype: float64

Untuk mendapatkan nilai skalar:

In [11]:
df.loc[dates[0],'A']

0.755034871161897

Untuk mendapatkan akses cepat ke skalar (setara dengan metode sebelumnya):

In [12]:
df.at[dates[0],'A']

0.755034871161897

## Selection by Position
Pilih melalui posisi bilangan bulat yang dilewati:

In [13]:
df.iloc[3]

A    0.355054
B    0.300695
C   -0.926397
D    1.703721
Name: 2013-01-04 00:00:00, dtype: float64

Dengan irisan integer, bertindak mirip dengan numpy / python:

In [14]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.355054  0.300695
2013-01-05 -0.759857  0.366894

Dengan daftar lokasi posisi bilangan bulat, mirip dengan gaya numpy / python:

In [15]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.257250  1.093545
2013-01-03 -0.922617 -2.533124
2013-01-05 -0.759857 -1.023559

For slicing rows explicitly:

In [16]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.257250 -0.765153  1.093545  0.420117
2013-01-03 -0.922617  2.047103 -2.533124  0.690853

Untuk memotong kolom secara eksplisit:

In [17]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.484612 -0.717522
2013-01-02 -0.765153  1.093545
2013-01-03  2.047103 -2.533124
2013-01-04  0.300695 -0.926397
2013-01-05  0.366894 -1.023559
2013-01-06  1.064458  0.188206

Untuk mendapatkan nilai secara eksplisit:

In [18]:
df.iloc[1,1]

-0.7651533932328203

Untuk mendapatkan akses cepat ke skalar (setara dengan metode sebelumnya):

In [19]:
df.iat[1,1]

-0.7651533932328203

## Boolean Indexing
Menggunakan nilai satu kolom untuk memilih data.

In [20]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.755035 -0.484612 -0.717522 -0.687850
2013-01-04  0.355054  0.300695 -0.926397  1.703721

Memilih nilai dari DataFrame di mana kondisi boolean terpenuhi.

In [21]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.755035       NaN       NaN       NaN
2013-01-02       NaN       NaN  1.093545  0.420117
2013-01-03       NaN  2.047103       NaN  0.690853
2013-01-04  0.355054  0.300695       NaN  1.703721
2013-01-05       NaN  0.366894       NaN  0.070350
2013-01-06       NaN  1.064458  0.188206       NaN

Menggunakan metode `isin()` untuk memfilter:

In [22]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.922617  2.047103 -2.533124  0.690853   two
2013-01-05 -0.759857  0.366894 -1.023559  0.070350  four

## Setting
Mengatur kolom baru secara otomatis menyelaraskan data dengan indeks.

In [23]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
print(s1)
df['F'] = s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

Menetapkan nilai berdasarkan label:

In [24]:
df.at[dates[0],'A'] = 0

Menetapkan nilai berdasarkan posisi:

In [25]:
In [49]: df.iat[0,1] = 0

Pengaturan dengan menetapkan dengan array NumPy:

In [26]:
In [50]: df.loc[:,'D'] = np.array([5] * len(df))

Hasil dari pengaturan operasi sebelumnya.

In [27]:
df
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.717522 -5  NaN
2013-01-02 -0.257250 -0.765153 -1.093545 -5 -1.0
2013-01-03 -0.922617 -2.047103 -2.533124 -5 -2.0
2013-01-04 -0.355054 -0.300695 -0.926397 -5 -3.0
2013-01-05 -0.759857 -0.366894 -1.023559 -5 -4.0
2013-01-06 -1.370062 -1.064458 -0.188206 -5 -5.0

## Missing Data
panda terutama menggunakan nilai np.nan untuk merepresentasikan data yang hilang. Secara default tidak termasuk dalam perhitungan.

Reindexing memungkinkan Anda mengubah / menambah / menghapus indeks pada sumbu tertentu. Ini mengembalikan salinan data.

In [28]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.717522  5  NaN  1.0
2013-01-02 -0.257250 -0.765153  1.093545  5  1.0  1.0
2013-01-03 -0.922617  2.047103 -2.533124  5  2.0  NaN
2013-01-04  0.355054  0.300695 -0.926397  5  3.0  NaN

Untuk menjatuhkan setiap baris yang memiliki data yang hilang.

In [29]:
df1.dropna(how='any')

                  A         B         C  D    F    E
2013-01-02 -0.25725 -0.765153  1.093545  5  1.0  1.0

Mengisi data yang hilang.

In [30]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.717522  5  5.0  1.0
2013-01-02 -0.257250 -0.765153  1.093545  5  1.0  1.0
2013-01-03 -0.922617  2.047103 -2.533124  5  2.0  5.0
2013-01-04  0.355054  0.300695 -0.926397  5  3.0  5.0

Untuk mendapatkan topeng boolean di mana nilai-nilai NaN.

In [31]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations
### Stats
Operasi secara umum mengecualikan data yang hilang. Melakukan statistik deskriptif:

In [32]:
df.mean()

A   -0.492455
B    0.502333
C   -0.653142
D    5.000000
F    3.000000
dtype: float64

Operasi yang sama pada sumbu lainnya:

In [33]:
df.mean(1)

2013-01-01    1.070619
2013-01-02    1.214228
2013-01-03    1.118272
2013-01-04    1.545870
2013-01-05    1.516696
2013-01-06    1.976520
Freq: D, dtype: float64

Beroperasi dengan objek yang memiliki dimensi berbeda dan membutuhkan penyelarasan. Selain itu, panda secara otomatis disiarkan di sepanjang dimensi yang ditentukan.

In [34]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.922617  1.047103 -3.533124  4.0  1.0
2013-01-04 -2.644946 -2.699305 -3.926397  2.0  0.0
2013-01-05 -5.759857 -4.633106 -6.023559  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply
Applying functions to the data:

In [35]:
df.apply(np.cumsum)
df.apply(lambda x: x.max() - x.min())

A    1.725117
B    2.812256
C    3.626668
D    0.000000
F    4.000000
dtype: float64

### Histogramming
Lihat lebih lanjut di [Histogramming dan Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization).

In [36]:
s = pd.Series(np.random.randint(0, 7, size=10))
s
s.value_counts()

1    3
6    2
5    1
4    1
3    1
2    1
0    1
dtype: int64

### String Methods
Seri ini dilengkapi dengan satu set metode pemrosesan string di atribut str yang membuatnya mudah untuk beroperasi pada setiap elemen dari array, seperti pada potongan kode di bawah ini.

Perhatikan bahwa pencocokan pola dalam str umumnya menggunakan [regular expression](https://docs.python.org/3/library/re.html) secara default (dan dalam beberapa kasus selalu menggunakannya). Lihat lebih lanjut di [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods)

In [37]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object


## Merge
### Concat
Pandas menyediakan berbagai fasilitas untuk dengan mudah menggabungkan bersama-sama Seri, DataFrame, dan objek Panel dengan berbagai jenis logika yang ditetapkan untuk indeks dan fungsionalitas aljabar relasional dalam kasus operasi gabungan / penggabungan.

Menggabungkan objek panda bersama dengan `concat()`:

In [38]:
df = pd.DataFrame(np.random.randn(10, 4))
df
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.118427  0.190108 -0.453150 -1.093824
1  0.015795 -0.801392 -0.558359 -0.288907
2 -0.258384  1.954766  1.324889  2.252112
3  0.107187  0.043142 -2.979815  0.572610
4 -0.064760 -1.481823  0.427584  0.612114
5  1.882999  0.217800 -1.588313 -1.320067
6  0.651584  0.314119 -0.889263  1.692006
7 -0.224523 -0.280542  0.015149  0.894384
8  0.671175 -0.811100  0.446504  0.242372
9 -0.398880  0.562806 -1.127063  0.476283

### Join
Gaya gabungan SQL, lihat lebih lanjut [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [39]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left
right
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Contoh lain yang bisa diberikan adalah:

In [40]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left
right
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append
Tambahkan baris ke dataframe. Lihat bagian [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation).

In [41]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.866441 -0.468115 -0.737924 -0.715929
1 -0.185219  1.530892  1.620639  0.948174
2 -0.388351  0.246904 -0.044574  0.825825
3 -1.561208 -0.747205 -0.410400 -0.572818
4  0.265459  0.857843 -1.642613 -0.547174
5  0.925984  0.721344  0.881657  0.263759
6  1.005163 -0.025071 -0.926894  1.185703
7  0.156680  1.671611  0.871033 -0.014317
8 -1.561208 -0.747205 -0.410400 -0.572818

## Grouping
Dengan "group by" kami mengacu pada proses yang melibatkan satu atau lebih dari langkah-langkah berikut:
- Splitting
- Applying
- Combining

In [42]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                            'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                            'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.046118  0.054247
1  bar    one -0.014827 -0.397806
2  foo    two -0.654255 -0.614107
3  bar  three -0.101134  1.922848
4  foo    two  0.987511 -0.856157
5  bar    two -2.081752  0.334808
6  foo    one -1.077867 -1.456799
7  foo  three  0.592706 -1.632559

Pengelompokan dan kemudian menerapkan fungsi `sum()` ke grup yang dihasilkan.

In [43]:
df.groupby('A').sum()

            C         D
A
bar -2.197714  1.859850
foo -1.198022 -4.505375

Pengelompokan berdasarkan beberapa kolom membentuk indeks hierarkis, dan lagi kita dapat menerapkan fungsi `sum`.

In [44]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.014827 -0.397806
    three -0.101134  1.922848
    two   -2.081752  0.334808
foo one   -2.123985 -1.402551
    three  0.592706 -1.632559
    two    0.333256 -1.470265

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                        'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                        'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
print(df2)
stacked = df2.stack()
print(stacked)
print(stacked.unstack())
print(stacked.unstack(1))
print(stacked.unstack(0))

### Pivot Tables
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                    'B' : ['A', 'B', 'C'] * 4,
                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                    'D' : np.random.randn(12),
                    'E' : np.random.randn(12)})
print(df)
print(pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C']))

## Time Series
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
print(ts.resample('5Min').sum())

rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
print(ts)
ts_utc = ts.tz_localize('UTC')
print(ts_utc)
print(ts_utc.tz_convert('US/Eastern'))
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
print(ts)
ps = ts.to_period()
print(ps)
print(ps.to_timestamp())
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
print(ts.head())

## Categoricals
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df["grade"] = df["raw_grade"].astype("category")
print(df["grade"])

df["grade"].cat.categories = ["very good", "good", "very bad"]
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
print(df["grade"])
print(df.sort_values(by="grade"))
print(df.groupby("grade").size())

## Plotting
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
print(ts.plot())
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])
print(df = df.cumsum())
plt.figure()
df.plot()
print(plt.legend(loc='best'))

## Getting Data In/Out
### CSV
# df.to_csv('foo.csv')
# pd.read_csv('foo.csv')

### HDF5
# df.to_hdf('foo.h5','df')
# print(pd.read_hdf('foo.h5','df'))

### Excel
# df.to_excel('foo.xlsx', sheet_name='Sheet1')
# print(pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA']))